// --------------------------------------------------
//   Require
// --------------------------------------------------

// ---------------------------------------------
//   Console
// ---------------------------------------------

const chalk = require('chalk');
const util = require('util');


// ---------------------------------------------
//   Node Packages
// ---------------------------------------------

const lodashGet = require('lodash/get');




// --------------------------------------------------
//   function
// --------------------------------------------------

/**
 * Cookieからデータを取得する
 * https://nodemailer.com/about/
 * @param {string} cookie - document.cookie
 * @param {string} key - 取得したいkey
 */
const getCookie = ({ cookie, key }) => {
  
  return ((cookie + ';').match(key + '=([^¥S;]*)')||[])[1];
  
};




// --------------------------------------------------
//   Export
// --------------------------------------------------

module.exports = {
  getCookie,
};